# **Data Science Learners Hub**

**Module : SQL**

**Topic :** Data Definition Language (DDL)

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

In [1]:
USE DataScienceLearnersHub

### **1\. Create a simple table:**

  

- Let's create a table named \`Employees\` to illustrate examples for DDL.

In [4]:
CREATE TABLE tblEmployees (
    EmployeeID INT PRIMARY KEY,
    FirstName VARCHAR(50),
    LastName VARCHAR(50),
    Department VARCHAR(50),
    Salary DECIMAL(10, 2)
);

### **2\. Insert queries:**

  

- Insert some sample data into the table:

In [6]:
INSERT INTO tblEmployees VALUES (1, 'Laxman', 'Rathod', 'IT', 60000.00);
INSERT INTO tblEmployees VALUES (2, 'Abhiram', 'A', 'HR', 50000.00);
INSERT INTO tblEmployees VALUES (3, 'Padma', 'Chauhan', 'Finance', 70000.00);
INSERT INTO tblEmployees VALUES (4, 'Naresh', 'M', 'IT', 55000.00);
INSERT INTO tblEmployees VALUES (5, 'Hari', 'Singh', 'Marketing', 65000.00);

### **3\. Data Definition Language (DDL) in MS SQL Server:**

  

- Data Definition Language (DDL) in SQL Server is a set of commands used to define, modify, and delete database structures. 
- Common DDL commands include CREATE, ALTER, and DROP.

### **4\. Types of DDL Commands:**

**a. CREATE TABLE:**

- Creates a new table in the database.

**Syntax :**

  

  CREATE TABLE table\_name (

      column1 datatype,

      column2 datatype,

      ...

  );

In [7]:
 --  This command creates a new table named `Departments` with columns `DepartmentID` and `DepartmentName`.
 
 CREATE TABLE Departments (
      DepartmentID INT PRIMARY KEY,
      DepartmentName VARCHAR(50)
  );

**b. ALTER TABLE:**

- Modifies an existing table structure, such as adding, modifying, or dropping columns.

**Syntax :**

  ALTER TABLE table\_name

  \[ADD column\_name datatype\]

  \[ALTER COLUMN column\_name datatype\]

  \[DROP COLUMN column\_name\];

In [8]:
SELECT * FROM tblEmployees

EmployeeID,FirstName,LastName,Department,Salary
1,Laxman,Rathod,IT,60000.00
2,Abhiram,A,HR,50000.00
3,Padma,Chauhan,Finance,70000.00
4,Naresh,M,IT,55000.00
5,Hari,Singh,Marketing,65000.00

In [14]:
  -- Add a new column
  ALTER TABLE tblEmployees
  ADD Email VARCHAR(100);

In [15]:
SELECT * FROM tblEmployees

EmployeeID,FirstName,LastName,Department,Salary,Email
1,Laxman,Rathod,IT,60000.00,NULL
2,Abhiram,A,HR,50000.00,NULL
3,Padma,Chauhan,Finance,70000.00,NULL
4,Naresh,M,IT,55000.00,NULL
5,Hari,Singh,Marketing,65000.00,NULL

In [12]:
ALTER TABLE tblEmployees
ALTER COLUMN Email VARCHAR(100);

: Msg 4924, Level 16, State 1, Line 1
ALTER TABLE ALTER COLUMN failed because column 'Email' does not exist in table 'tblEmployees'.